sur = input("Введите фамилию:")
name = input("Введите имя:")
group = input("Введите группу:")
gor = input("Введите город:")

age = int(input("Введите возраст в полных годах:"))
while age < 1 or age > 120:
    print("Ошибка, введите реальный возраст")
    age = int(input("Введите возраст в полных годах:"))

lp = input("Введите любимый предмет:")

proverka = input("Введите колво часов подготовки в неделю:")
while "." not in proverka or float(proverka) < 0:
    print("Ошибка, введите неотрицательное дробное число")
    proverka = input("Введите колво часов подготовки в неделю:")
hpw = float(proverka)
print("Карточка студента:")
print("Имя:", name, "Фамилия:" , sur, "Возраст через 4 года:", age + 4,)
print("Время подготовки за 4 недели:", hpw * 4, "Среднее время подготовки в день за неделю", hpw / 7,)