f = input("Введите название 1 предмета: ")
t = input("Введите название 2 предмета: ")

kz1 = int(input("Введите кол-во занятий за неделю предмета " + f + ": "))
while kz1 < 0:
    print("Введите целые и неотрицательные числа")
    kz1 = int(input("Введите кол-во занятий за неделю предмета " + f + ": "))

kz2 = int(input("Введите кол-во занятий за неделю предмета " + t + ": "))
while kz2 < 0:
    print("Введите целые и неотрицательные числа")
    kz1 = int(input("Введите кол-во занятий за неделю предмета " + f + ": "))

km1 = int(input("Введите продолжительность 1 занятия предмета " + f + " в минутах: "))
while km1 < 0:
    print("Введите положительные и целые числа")
    km1 = int(input("Введите кол-во занятий за неделю предмета " + f + ": "))

km2 = int(input("Введите продолжительность 1 занятия предмета " + t + " в минутах: "))
while km2 < 0:
    print("Введите положительные и целые числа")
    km2 = int(input("Введите кол-во занятий за неделю предмета " + t + ": "))

sum = (kz1 * km1) + (kz2 * km2) #сумма мин 
sumih = sum/60 #сумма часы
nagr = sumih * 4

dos = float(input("Введите доступное время на неделю в часах: "))
while dos < sumih:
     print("Доступное время на неделю не меньше суммарной нагрузки")
     dos = float(input("Введите доступное время на неделю в часах: "))

ost = dos - sumih
fm = kz1 * km1  #сумма 1 мин
tm = kz2 * km2  #сумма 2 мин

print("Предмет: ", f, "Продолжительность 1 занятия в минутах: ", km1, "")
print("Предмет: ", t, "Продолжительность 1 занятия в минутах: ", km2,)
print("Общая нагрузка в минутах: ", sum, "Общая нагрузка в часах: ", sumih,)
print("Остаток свободного времени в часах : ", ost, "Нагрузка за четыре одинаковые недели: ", nagr,)